---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeTopsideSurface
source: html/6ee84229-5669-5901-abcf-ff713e6d99cb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeTopsideSurface Property

"Topside Surface": Topside Surface

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupporttypeTopsideSurface { get; }
```